; domain
(define (domain drone-dom)

    (:requirements
        :strips :typing
    )

    (:types
        drone human box content location carrier num
    )

    (:predicates
        (drone-at ?d - drone ?l - location) 
        (drone-free ?d - drone)
        (drone-carry-box ?d - drone ?b - box)
        (human-at ?h - human ?l - location)
        (human-has ?h - human ?c - content)
        (box-at ?b - box ?l - location)
        (box-has ?b - box ?c - content)
        (box-free ?b - box)
        (carrier-at ?c - carrier ?l - location)
        (carrier-has-box ?c ?b)
        (next ?n1 ?n2 - num)
        (carrier-n-boxes ?c - carrier ?n - num)
    )

    (:action move-carrier
        :parameters (?d - drone ?to ?from - location ?c - carrier)
        :precondition (and
            (drone-free ?d)
            (drone-at ?d ?from)
            (carrier-at ?c ?from)
        )
        :effect (and
            (not(carrier-at ?c ?from)); el carrier deja de estar en la localización
            (not(drone-at ?d ?from))
            (carrier-at ?c ?to)
            (drone-at ?d ?to)
        )
    )

    (:action move
       :parameters (?d - drone ?from ?to - location)
       :precondition (and 
           (drone-at ?d ?from)
       )
       :effect (and
           (drone-at ?d ?to) 
           (not (drone-at ?d ?from))
       )
    )

    (:action put-box-on-carrier
        :parameters (?d - drone ?b - box ?l - location ?c - carrier ?n1 ?n2 - num)
        :precondition (and 
            (drone-at ?d ?l)
            (carrier-at ?c ?l) ;debe estar bajado el carrier
            (drone-carry-box ?d ?b) ;el dron tiene que tener la caja (haber hecho pick-up)
            (next ?n1 ?n2) ;no ha llegado al limite de capacidad
            (carrier-n-boxes ?c ?n1)
        )
        :effect (and
            (drone-free ?d)
            (not (drone-carry-box ?d ?b)) ;el dron deja de tener la caja
            (carrier-has-box ?c ?b) ;para tenerla el carrier
            (not (carrier-n-boxes ?c ?n1))
            (carrier-n-boxes ?c ?n2)
        )
    )
    
    (:action pick-up
        :parameters (?d - drone ?b - box ?c - content ?l - location)
        :precondition (and 
            (drone-at ?d ?l)
            (box-at ?b ?l)
            (drone-free ?d)
            (box-has ?b ?c)
            (box-free ?b)
        )
        :effect (and
            (drone-carry-box ?d ?b)
            (not (drone-free ?d))
            (not (box-at ?b ?l))
        )
    )

    (:action take-off-box-carrier
        :parameters (?d - drone ?b - box ?l - location ?c - carrier ?n1 ?n2 - num)
        :precondition (and 
            (drone-at ?d ?l)
            (carrier-at ?c ?l) ;el carrier y el dron deben estar en el mismo sitio
            (carrier-has-box ?c ?b) ;la caja a coger la tiene que tener el carrier
            (drone-free ?d) ;el dron tiene que estar vacio
            (carrier-n-boxes ?c ?n2)
            (next ?n1 ?n2)
        )
        :effect (and
            (not(drone-free ?d))
            (drone-carry-box ?d ?b) ;el dron coge la caja, y
            (not(carrier-has-box ?c ?b)) ;el carrier ya no la tendrá
            (carrier-n-boxes ?c ?n1)
            (not(carrier-n-boxes ?c ?n2))
        )
    )
    
    (:action drop
        :parameters (?d - drone ?b - box ?c - content ?l - location ?h - human)
        :precondition (and 
            (drone-carry-box ?d ?b)
            (drone-at ?d ?l)
            (human-at ?h ?l)
            (box-has ?b ?c)
        )
        :effect (and
            (drone-free ?d)
            (box-at ?b ?l)
            (human-has ?h ?c)
            (not (drone-carry-box ?d ?b))
            (not (box-free ?b))
        )
    )
)

; problem
(define (problem drone_problem_d1_r0_l10_p10_c10_g10_ct2)
(:domain drone-dom)
(:objects
	drone1 - drone
	warehouse - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	box1 - box
	box2 - box
	box3 - box
	box4 - box
	box5 - box
	box6 - box
	box7 - box
	box8 - box
	box9 - box
	box10 - box
	food - content
	meds - content
	human1 - human
	human2 - human
	human3 - human
	human4 - human
	human5 - human
	human6 - human
	human7 - human
	human8 - human
	human9 - human
	human10 - human
)

(:init
	(drone-at drone1 warehouse)
	(drone-free drone1)
	(box-at box1 warehouse)
	(box-free box1)
	(box-at box2 warehouse)
	(box-free box2)
	(box-at box3 warehouse)
	(box-free box3)
	(box-at box4 warehouse)
	(box-free box4)
	(box-at box5 warehouse)
	(box-free box5)
	(box-at box6 warehouse)
	(box-free box6)
	(box-at box7 warehouse)
	(box-free box7)
	(box-at box8 warehouse)
	(box-free box8)
	(box-at box9 warehouse)
	(box-free box9)
	(box-at box10 warehouse)
	(box-free box10)
	(box-has box1 food)
	(box-has box2 food)
	(box-has box3 food)
	(box-has box4 food)
	(box-has box5 food)
	(box-has box6 food)
	(box-has box7 meds)
	(box-has box8 meds)
	(box-has box9 meds)
	(box-has box10 meds)
	(human-at human1 loc3)
	(human-at human2 loc3)
	(human-at human3 loc9)
	(human-at human4 loc2)
	(human-at human5 loc2)
	(human-at human6 loc9)
	(human-at human7 loc5)
	(human-at human8 loc6)
	(human-at human9 loc9)
	(human-at human10 loc6)
)

(:goal (and

	(drone-at drone1 warehouse)
	(human-has human1 food)
	(human-has human2 meds)
	(human-has human3 meds)
	(human-has human4 food)
	(human-has human4 meds)
	(human-has human5 food)
	(human-has human6 food)
	(human-has human8 meds)
	(human-has human9 food)
	(human-has human10 food)
	))
)

; plan
1. (pick-up drone1 box10 meds warehouse)
   deleted: (drone-free drone1) (box-at box10 warehouse)
   added: (drone-carry-box drone1 box10)
   goals met: 1 of 11
2. (move drone1 warehouse loc3)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc3)
   goals met: 0 of 11
3. (drop drone1 box10 meds loc3 human2)
   deleted: (drone-carry-box drone1 box10) (box-free box10)
   added: (drone-free drone1) (box-at box10 loc3) (human-has human2 meds)
   goals met: 1 of 11
4. (move drone1 loc3 warehouse)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 warehouse)
   goals met: 2 of 11
5. (pick-up drone1 box9 meds warehouse)
   deleted: (drone-free drone1) (box-at box9 warehouse)
   added: (drone-carry-box drone1 box9)
   goals met: 2 of 11
6. (move drone1 warehouse loc2)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc2)
   goals met: 1 of 11
7. (drop drone1 box9 meds loc2 human4)
   deleted: (drone-carry-box drone1 box9) (box-free box9)
   added: (drone-free drone1) (box-at box9 loc2) (human-has human4 meds)
   goals met: 2 of 11
8. (move drone1 loc2 warehouse)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 3 of 11
9. (pick-up drone1 box8 meds warehouse)
   deleted: (drone-free drone1) (box-at box8 warehouse)
   added: (drone-carry-box drone1 box8)
   goals met: 3 of 11
10. (move drone1 warehouse loc9)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc9)
   goals met: 2 of 11
11. (drop drone1 box8 meds loc9 human3)
   deleted: (drone-carry-box drone1 box8) (box-free box8)
   added: (drone-free drone1) (box-at box8 loc9) (human-has human3 meds)
   goals met: 3 of 11
12. (move drone1 loc9 warehouse)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 warehouse)
   goals met: 4 of 11
13. (pick-up drone1 box7 meds warehouse)
   deleted: (drone-free drone1) (box-at box7 warehouse)
   added: (drone-carry-box drone1 box7)
   goals met: 4 of 11
14. (move drone1 warehouse loc6)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc6)
   goals met: 3 of 11
15. (drop drone1 box7 meds loc6 human8)
   deleted: (drone-carry-box drone1 box7) (box-free box7)
   added: (drone-free drone1) (box-at box7 loc6) (human-has human8 meds)
   goals met: 4 of 11
16. (move drone1 loc6 warehouse)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 warehouse)
   goals met: 5 of 11
17. (pick-up drone1 box6 food warehouse)
   deleted: (drone-free drone1) (box-at box6 warehouse)
   added: (drone-carry-box drone1 box6)
   goals met: 5 of 11
18. (move drone1 warehouse loc3)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc3)
   goals met: 4 of 11
19. (drop drone1 box6 food loc3 human1)
   deleted: (drone-carry-box drone1 box6) (box-free box6)
   added: (drone-free drone1) (box-at box6 loc3) (human-has human1 food)
   goals met: 5 of 11
20. (move drone1 loc3 loc2)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 loc2)
   goals met: 5 of 11
21. (move drone1 loc2 warehouse)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 6 of 11
22. (pick-up drone1 box5 food warehouse)
   deleted: (drone-free drone1) (box-at box5 warehouse)
   added: (drone-carry-box drone1 box5)
   goals met: 6 of 11
23. (move drone1 warehouse loc6)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc6)
   goals met: 5 of 11
24. (drop drone1 box5 food loc6 human10)
   deleted: (drone-carry-box drone1 box5) (box-free box5)
   added: (drone-free drone1) (box-at box5 loc6) (human-has human10 food)
   goals met: 6 of 11
25. (move drone1 loc6 loc2)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 loc2)
   goals met: 6 of 11
26. (move drone1 loc2 warehouse)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 7 of 11
27. (pick-up drone1 box4 food warehouse)
   deleted: (drone-free drone1) (box-at box4 warehouse)
   added: (drone-carry-box drone1 box4)
   goals met: 7 of 11
28. (move drone1 warehouse loc2)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc2)
   goals met: 6 of 11
29. (drop drone1 box4 food loc2 human4)
   deleted: (drone-carry-box drone1 box4) (box-free box4)
   added: (drone-free drone1) (box-at box4 loc2) (human-has human4 food)
   goals met: 7 of 11
30. (move drone1 loc2 warehouse)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 8 of 11
31. (pick-up drone1 box3 food warehouse)
   deleted: (drone-free drone1) (box-at box3 warehouse)
   added: (drone-carry-box drone1 box3)
   goals met: 8 of 11
32. (move drone1 warehouse loc2)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc2)
   goals met: 7 of 11
33. (drop drone1 box3 food loc2 human5)
   deleted: (drone-carry-box drone1 box3) (box-free box3)
   added: (drone-free drone1) (box-at box3 loc2) (human-has human5 food)
   goals met: 8 of 11
34. (move drone1 loc2 loc9)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 loc9)
   goals met: 8 of 11
35. (move drone1 loc9 warehouse)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 warehouse)
   goals met: 9 of 11
36. (pick-up drone1 box2 food warehouse)
   deleted: (drone-free drone1) (box-at box2 warehouse)
   added: (drone-carry-box drone1 box2)
   goals met: 9 of 11
37. (move drone1 warehouse loc9)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc9)
   goals met: 8 of 11
38. (drop drone1 box2 food loc9 human6)
   deleted: (drone-carry-box drone1 box2) (box-free box2)
   added: (drone-free drone1) (box-at box2 loc9) (human-has human6 food)
   goals met: 9 of 11
39. (move drone1 loc9 warehouse)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 warehouse)
   goals met: 10 of 11
40. (pick-up drone1 box1 food warehouse)
   deleted: (drone-free drone1) (box-at box1 warehouse)
   added: (drone-carry-box drone1 box1)
   goals met: 10 of 11
41. (move drone1 warehouse loc9)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc9)
   goals met: 9 of 11
42. (drop drone1 box1 food loc9 human9)
   deleted: (drone-carry-box drone1 box1) (box-free box1)
   added: (drone-free drone1) (box-at box1 loc9) (human-has human9 food)
   goals met: 10 of 11
43. (move drone1 loc9 warehouse)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 warehouse)
   goals met: 11 of 11
